# #вводится 2 числа 
# a = int(input("Введите первое число "))
# b = int(input("Введите второе число "))

# if a > b:
#     print("a > b")
# elif a < b:
#     print("a < b")
# else:
#     print("a = b")

# n = 700
# m = 750

# result = (m/n)


# print(result+1)


# Задача №5. Общее обсуждение
# 5.Вагоны в электричке пронумерованы
# натуральными числами, начиная с 1 (при этом иногда
# вагоны нумеруются от «головы» поезда, а иногда – с
# «хвоста»; это зависит от того, в какую сторону едет
# электричка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил,
# что его вагон имеет номер j. Он хочет определить,
# сколько всего вагонов в электричке. Напишите
# программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать
# невозможно.
# Input: 3 4(ввод на разных строках)
# Output: 6



# a = int(input("Введите номер вагона "))
# b = int(input("Общее количество вагонов "))

# if(a==b):
#     print("Неизветсно")
# else:
#     print(a-1+b)   # вычитается тот вагон в котором мы находимся

# Работает
 



# Задача №7. Решение в группах
# Дано натуральное число. Требуется определить,
# является ли год с данным номером високосным. Если
# год является високосным, то выведите YES, иначе
# выведите NO. Напомним, что в соответствии с
# григорианским календарем, год является
# високосным, если его номер кратен 4, но не кратен
# 100, а также если он кратен 400.
# Input: 2016
# Output: YES


# year = 2016

# if(year%4 == 0 and year %100 != 0 or year%400 == 0):
#     print("yes")
# else:
#     print("no")
    

#  Работает

